package work;

/**----------------------------------------------------------------------*
 *■■■SaveRecordsBLクラス■■■
 *概要：ビジネスロジック（毎日の記録データの登録）
 *----------------------------------------------------------------------**/
public class SaveRecordsBL {

	/**----------------------------------------------------------------------*
	 *■executeInsertRecordsメソッド
	 *概要　：対象の毎日の記録データを登録する
	 *引数　：対象の毎日の記録データ（RecordsDto型）
	 *戻り値：DB操作成功フラグ（true:成功/false:失敗）
	 *----------------------------------------------------------------------**/
	public boolean executeInsertRecords(RecordsDto dto) {

		boolean succesInsert = false ;  //DB操作成功フラグ（true:成功/false:失敗）

		//-------------------------------------------
		//データベースへの接続を実施
		//-------------------------------------------

		//DAOクラスをインスタンス化＆対象の毎日の記録データを登録するよう依頼
		RecordsDao dao = new RecordsDao();
		succesInsert = dao.doInsert(dto);

		return succesInsert;
	}

}
