package work;

import java.util.List;

/**----------------------------------------------------------------------*
 *■■■ShowAllRecordsBLクラス■■■
 *概要：ビジネスロジック（毎日の記録データの全件表示）
 *----------------------------------------------------------------------**/
public class ShowAllRecordsBL {

	/**----------------------------------------------------------------------*
	 *■executeSelectRecordsメソッド
	 *概要　：毎日の記録データを全件抽出する
	 *引数　：なし
	 *戻り値：抽出結果（DTOリスト）
	 *----------------------------------------------------------------------**/
	public List<RecordsDto> executeSelectRecords() {

		//-------------------------------------------
		//データベースへの接続を実施
		//-------------------------------------------

		//DAOクラスをインスタンス化＆対象のユーザーデータを抽出するよう依頼
		RecordsDao dao = new RecordsDao();
		List<RecordsDto> dtoList= dao.doSelect();

		return dtoList;
	}

}
